Tekla.Structures.DirectManipulation.Adapter.Controls.InteropExtensions
The Tekla.Structures.DirectManipulation.Adapter.Controls.InteropExtensions class is an extension class for general purpose interoperation conversion methods used by DM controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.InteropExtensions.ToBrush(System.Drawing.Bitmap)
Converts a System.Drawing.Bitmap to a System.Windows.Media.Brush.
source: The source System.Drawing.Bitmap.
Returns: The converted System.Windows.Media.Brush.

Tekla.Structures.DirectManipulation.Adapter.Controls.InteropExtensions.ToBrush(System.Drawing.Image)
Converts a System.Drawing.Image to a System.Windows.Media.Brush.
source: The source System.Drawing.Image.
Returns: The converted System.Windows.Media.Brush.

Tekla.Structures.DirectManipulation.Adapter.Controls.InteropExtensions.ToBitmapSource(System.Drawing.Image)
Converts a System.Drawing.Image to a System.Windows.Media.Imaging.BitmapSource.
source: The source System.Drawing.Image.
Returns: The converted System.Windows.Media.Imaging.BitmapSource.

Tekla.Structures.DirectManipulation.Adapter.Controls.InteropExtensions.DeleteObject(System.IntPtr)
The import for deleting an object with a specific handle.
handle: The pointer to the object handle.
Returns: 1 on success; otherwise, non-zero values.